testCases/T3C2/mykkLOmega/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


converToMeters 1.0;
vertices
(
    (-0.15 0 0)
    (0 0 0)
    (1.7 0 0)
    (-0.15 0 0.1)
    (0 0 0.1)
    (1.7 0 0.1) 
    (-0.15 0.3 0)
    (0 0.285 0)
    (1.7 0.2635964067000028 0 )
    (-0.15 0.3 0.1)
    (0 0.285 0.1)
    (1.7 0.2635964067000028 0.1)
);

blocks
(
    hex (0 1 7 6 3 4 10 9) (50 250 1) simpleGrading (0.1 100 1)
    hex (1 2 8 7 4 5 11 10) (300 250 1) simpleGrading (30 100 1)
);

edges
(
	spline 6 7 (
		(-0.14815 0.3 0) 
		(-0.14629999999999999 0.3 0) 
		(-0.14445 0.3 0) 
		(-0.1426 0.3 0) 
		(-0.14075 0.3 0) 
		(-0.1389 0.3 0) 
		(-0.13705 0.3 0) 
		(-0.1352 0.3 0) 
		(-0.13335 0.3 0) 
		(-0.1315 0.3 0) 
		(-0.12965 0.3 0) 
		(-0.1278 0.3 0) 
		(-0.12595 0.3 0) 
		(-0.12409999999999999 0.3 0) 
		(-0.12225 0.3 0) 
		(-0.1204 0.3 0) 
		(-0.11854999999999999 0.3 0) 
		(-0.1167 0.3 0) 
		(-0.11485 0.3 0) 
		(-0.11299999999999999 0.3 0) 
		(-0.11115 0.3 0) 
		(-0.1093 0.3 0) 
		(-0.10744999999999999 0.3 0) 
		(-0.1056 0.3 0) 
		(-0.10375 0.3 0) 
		(-0.10189999999999999 0.3 0) 
		(-0.10005 0.3 0) 
		(-0.0982 0.3 0) 
		(-0.09634999999999999 0.3 0) 
		(-0.0945 0.3 0) 
		(-0.09265 0.3 0) 
		(-0.09079999999999999 0.3 0) 
		(-0.08895 0.3 0) 
		(-0.0871 0.3 0) 
		(-0.08524999999999999 0.3 0) 
		(-0.0834 0.3 0) 
		(-0.08155 0.3 0) 
		(-0.0797 0.3 0) 
		(-0.07785 0.3 0) 
		(-0.076 0.3 0) 
		(-0.07415 0.3 0) 
		(-0.0723 0.3 0) 
		(-0.07045 0.3 0) 
		(-0.0686 0.3 0) 
		(-0.06675 0.3 0) 
		(-0.0649 0.3 0) 
		(-0.06305 0.3 0) 
		(-0.061200000000000004 0.3 0) 
		(-0.05935 0.3 0) 
		(-0.057499999999999996 0.3 0) 
		(-0.055650000000000005 0.3 0) 
		(-0.0538 0.3 0) 
		(-0.051949999999999996 0.3 0) 
		(-0.050100000000000006 0.3 0) 
		(-0.04825 0.3 0) 
		(-0.0464 0.3 0) 
		(-0.044550000000000006 0.3 0) 
		(-0.0427 0.3 0) 
		(-0.04085 0.3 0) 
		(-0.03900000000000001 0.3 0) 
		(-0.03715 0.3 0) 
		(-0.0353 0.3 0) 
		(-0.03345000000000001 0.3 0) 
		(-0.0316 0.3 0) 
		(-0.02975 0.3 0) 
		(-0.027900000000000008 0.3 0) 
		(-0.026050000000000004 0.3 0) 
		(-0.0242 0.3 0) 
		(-0.02235000000000001 0.2988531641090934 0) 
		(-0.02049999999999999 0.2976184950570221 0) 
		(-0.01865 0.29640028077380026 0) 
		(-0.01680000000000001 0.2951983475712957 0) 
		(-0.014949999999999991 0.29401252300051667 0) 
		(-0.0131 0.2928426358462794 0) 
		(-0.01125000000000001 0.29168851612188545 0) 
		(-0.009399999999999992 0.2905499950638105 0) 
		(-0.007550000000000001 0.2894269051264035 0) 
		(-0.005700000000000011 0.2883190799765963 0) 
		(-0.0038499999999999923 0.2872263544886242 0) 
		(-0.0020000000000000018 0.28614856473875716 0) 
		(-0.00015000000000001124 0.28508554800004154 0) 
	)
	spline 9 10 (
		(-0.14815 0.3 0.1) 
		(-0.14629999999999999 0.3 0.1) 
		(-0.14445 0.3 0.1) 
		(-0.1426 0.3 0.1) 
		(-0.14075 0.3 0.1) 
		(-0.1389 0.3 0.1) 
		(-0.13705 0.3 0.1) 
		(-0.1352 0.3 0.1) 
		(-0.13335 0.3 0.1) 
		(-0.1315 0.3 0.1) 
		(-0.12965 0.3 0.1) 
		(-0.1278 0.3 0.1) 
		(-0.12595 0.3 0.1) 
		(-0.12409999999999999 0.3 0.1) 
		(-0.12225 0.3 0.1) 
		(-0.1204 0.3 0.1) 
		(-0.11854999999999999 0.3 0.1) 
		(-0.1167 0.3 0.1) 
		(-0.11485 0.3 0.1) 
		(-0.11299999999999999 0.3 0.1) 
		(-0.11115 0.3 0.1) 
		(-0.1093 0.3 0.1) 
		(-0.10744999999999999 0.3 0.1) 
		(-0.1056 0.3 0.1) 
		(-0.10375 0.3 0.1) 
		(-0.10189999999999999 0.3 0.1) 
		(-0.10005 0.3 0.1) 
		(-0.0982 0.3 0.1) 
		(-0.09634999999999999 0.3 0.1) 
		(-0.0945 0.3 0.1) 
		(-0.09265 0.3 0.1) 
		(-0.09079999999999999 0.3 0.1) 
		(-0.08895 0.3 0.1) 
		(-0.0871 0.3 0.1) 
		(-0.08524999999999999 0.3 0.1) 
		(-0.0834 0.3 0.1) 
		(-0.08155 0.3 0.1) 
		(-0.0797 0.3 0.1) 
		(-0.07785 0.3 0.1) 
		(-0.076 0.3 0.1) 
		(-0.07415 0.3 0.1) 
		(-0.0723 0.3 0.1) 
		(-0.07045 0.3 0.1) 
		(-0.0686 0.3 0.1) 
		(-0.06675 0.3 0.1) 
		(-0.0649 0.3 0.1) 
		(-0.06305 0.3 0.1) 
		(-0.061200000000000004 0.3 0.1) 
		(-0.05935 0.3 0.1) 
		(-0.057499999999999996 0.3 0.1) 
		(-0.055650000000000005 0.3 0.1) 
		(-0.0538 0.3 0.1) 
		(-0.051949999999999996 0.3 0.1) 
		(-0.050100000000000006 0.3 0.1) 
		(-0.04825 0.3 0.1) 
		(-0.0464 0.3 0.1) 
		(-0.044550000000000006 0.3 0.1) 
		(-0.0427 0.3 0.1) 
		(-0.04085 0.3 0.1) 
		(-0.03900000000000001 0.3 0.1) 
		(-0.03715 0.3 0.1) 
		(-0.0353 0.3 0.1) 
		(-0.03345000000000001 0.3 0.1) 
		(-0.0316 0.3 0.1) 
		(-0.02975 0.3 0.1) 
		(-0.027900000000000008 0.3 0.1) 
		(-0.026050000000000004 0.3 0.1) 
		(-0.0242 0.3 0.1) 
		(-0.02235000000000001 0.2988531641090934 0.1) 
		(-0.02049999999999999 0.2976184950570221 0.1) 
		(-0.01865 0.29640028077380026 0.1) 
		(-0.01680000000000001 0.2951983475712957 0.1) 
		(-0.014949999999999991 0.29401252300051667 0.1) 
		(-0.0131 0.2928426358462794 0.1) 
		(-0.01125000000000001 0.29168851612188545 0.1) 
		(-0.009399999999999992 0.2905499950638105 0.1) 
		(-0.007550000000000001 0.2894269051264035 0.1) 
		(-0.005700000000000011 0.2883190799765963 0.1) 
		(-0.0038499999999999923 0.2872263544886242 0.1) 
		(-0.0020000000000000018 0.28614856473875716 0.1) 
		(-0.00015000000000001124 0.28508554800004154 0.1) 
	)
	spline 7 8 (
		(0.001700000000000007 0.2840371427370524 0) 
		(0.0035499999999999976 0.2830031886006568 0) 
		(0.005399999999999988 0.28198352642278757 0) 
		(0.0072500000000000064 0.28097799821122743 0) 
		(0.009099999999999997 0.2799864471444045 0) 
		(0.010949999999999988 0.27900871756619783 0) 
		(0.012800000000000006 0.27804465498075365 0) 
		(0.014649999999999996 0.2770941060473127 0) 
		(0.016499999999999987 0.2761569185750479 0) 
		(0.018350000000000005 0.27523294151791267 0) 
		(0.020199999999999996 0.2743220249694998 0) 
		(0.022049999999999986 0.2734240201579115 0) 
		(0.023900000000000005 0.2725387794406396 0) 
		(0.025749999999999995 0.2716661562994564 0) 
		(0.027599999999999986 0.2708060053353167 0) 
		(0.029450000000000004 0.26995818226326984 0) 
		(0.031299999999999994 0.2691225439073829 0) 
		(0.033149999999999985 0.26829894819567407 0) 
		(0.035 0.2674872541550574 0) 
		(0.036849999999999994 0.2666873219062974 0) 
		(0.038699999999999984 0.2658990126589749 0) 
		(0.04055 0.2651221887064632 0) 
		(0.04239999999999999 0.2643567134209151 0) 
		(0.044249999999999984 0.2636024512482606 0) 
		(0.0461 0.2628592677032149 0) 
		(0.04794999999999999 0.2621270293642977 0) 
		(0.04979999999999998 0.26140560386886263 0) 
		(0.05165 0.2606948599081374 0) 
		(0.05349999999999999 0.25999466722227477 0) 
		(0.05534999999999998 0.2593048965954142 0) 
		(0.0572 0.2586254198507542 0) 
		(0.05904999999999999 0.25795610984563483 0) 
		(0.06089999999999998 0.2572968404666317 0) 
		(0.06275 0.2566474866246597 0) 
		(0.06459999999999999 0.2560079242500885 0) 
		(0.06644999999999998 0.25537803028786743 0) 
		(0.0683 0.25475768269266214 0) 
		(0.07014999999999999 0.2541467604240013 0) 
		(0.07199999999999998 0.25354514344143386 0) 
		(0.07385 0.25295271269969777 0) 
		(0.07569999999999999 0.25236935014389833 0) 
		(0.07754999999999998 0.2517949387046977 0) 
		(0.0794 0.25122936229351556 0) 
		(0.08124999999999999 0.25067250579773925 0) 
		(0.08309999999999998 0.2501242550759456 0) 
		(0.08495 0.249584496953133 0) 
		(0.08679999999999999 0.24905311921596435 0) 
		(0.08864999999999998 0.24853001060802016 0) 
		(0.0905 0.2480150608250628 0) 
		(0.09234999999999999 0.24750816051031155 0) 
		(0.09419999999999998 0.2470092012497275 0) 
		(0.09605 0.2465180755673101 0) 
		(0.09789999999999999 0.24603467692040373 0) 
		(0.09974999999999998 0.245558899695015 0) 
		(0.1016 0.245090639201141 0) 
		(0.10345000000000001 0.2446297916681079 0) 
		(0.10529999999999998 0.24417625423992043 0) 
		(0.10715 0.24372992497062174 0) 
		(0.10900000000000001 0.24329070281966442 0) 
		(0.11084999999999998 0.24285848764729148 0) 
		(0.1127 0.24243318020992877 0) 
		(0.11455000000000001 0.2420146821555873 0) 
		(0.11639999999999998 0.2416028960192768 0) 
		(0.11825 0.24119772521842966 0) 
		(0.12010000000000001 0.24079907404833564 0) 
		(0.12194999999999998 0.24040684767758708 0) 
		(0.1238 0.24002095214353503 0) 
		(0.12565 0.2396412943477557 0) 
		(0.12749999999999997 0.2392677820515279 0) 
		(0.12935 0.23890032387132104 0) 
		(0.1312 0.23853882927429365 0) 
		(0.13304999999999997 0.23818320857380262 0) 
		(0.1349 0.23783337292492324 0) 
		(0.13675 0.2374892343199798 0) 
		(0.13859999999999997 0.23715070558408677 0) 
		(0.14045 0.23681770037070077 0) 
		(0.1423 0.2364901331571831 0) 
		(0.14414999999999997 0.23616791924037306 0) 
		(0.146 0.23585097473217173 0) 
		(0.14785 0.2355392165551367 0) 
		(0.14969999999999997 0.23523256243808705 0) 
		(0.15155 0.23493093091171946 0) 
		(0.1534 0.23463424130423455 0) 
		(0.15524999999999997 0.23434241373697426 0) 
		(0.1571 0.23405536912006944 0) 
		(0.15895 0.23377302914809872 0) 
		(0.16079999999999997 0.23349531629575737 0) 
		(0.16265 0.23322215381353728 0) 
		(0.1645 0.23295346572341746 0) 
		(0.16634999999999997 0.23268917681456514 0) 
		(0.1682 0.23242921263904753 0) 
		(0.17005 0.2321734995075545 0) 
		(0.17189999999999997 0.2319219644851315 0) 
		(0.17375 0.23167453538692334 0) 
		(0.1756 0.2314311407739289 0) 
		(0.17744999999999997 0.23119170994876592 0) 
		(0.1793 0.23095617295144696 0) 
		(0.18115 0.2307244605551658 0) 
		(0.18299999999999997 0.2304965042620945 0) 
		(0.18485 0.23027223629919114 0) 
...
	)
	spline 10 11(
		(0.001700000000000007 0.2840371427370524 0.1) 
		(0.0035499999999999976 0.2830031886006568 0.1) 
		(0.005399999999999988 0.28198352642278757 0.1) 
		(0.0072500000000000064 0.28097799821122743 0.1) 
		(0.009099999999999997 0.2799864471444045 0.1) 
		(0.010949999999999988 0.27900871756619783 0.1) 
		(0.012800000000000006 0.27804465498075365 0.1) 
		(0.014649999999999996 0.2770941060473127 0.1) 
		(0.016499999999999987 0.2761569185750479 0.1) 
		(0.018350000000000005 0.27523294151791267 0.1) 
		(0.020199999999999996 0.2743220249694998 0.1) 
		(0.022049999999999986 0.2734240201579115 0.1) 
		(0.023900000000000005 0.2725387794406396 0.1) 
		(0.025749999999999995 0.2716661562994564 0.1) 
		(0.027599999999999986 0.2708060053353167 0.1) 
		(0.029450000000000004 0.26995818226326984 0.1) 
		(0.031299999999999994 0.2691225439073829 0.1) 
		(0.033149999999999985 0.26829894819567407 0.1) 
		(0.035 0.2674872541550574 0.1) 
		(0.036849999999999994 0.2666873219062974 0.1) 
		(0.038699999999999984 0.2658990126589749 0.1) 
		(0.04055 0.2651221887064632 0.1) 
		(0.04239999999999999 0.2643567134209151 0.1) 
		(0.044249999999999984 0.2636024512482606 0.1) 
		(0.0461 0.2628592677032149 0.1) 
		(0.04794999999999999 0.2621270293642977 0.1) 
		(0.04979999999999998 0.26140560386886263 0.1) 
		(0.05165 0.2606948599081374 0.1) 
		(0.05349999999999999 0.25999466722227477 0.1) 
		(0.05534999999999998 0.2593048965954142 0.1) 
		(0.0572 0.2586254198507542 0.1) 
		(0.05904999999999999 0.25795610984563483 0.1) 
		(0.06089999999999998 0.2572968404666317 0.1) 
		(0.06275 0.2566474866246597 0.1) 
		(0.06459999999999999 0.2560079242500885 0.1) 
		(0.06644999999999998 0.25537803028786743 0.1) 
		(0.0683 0.25475768269266214 0.1) 
		(0.07014999999999999 0.2541467604240013 0.1) 
		(0.07199999999999998 0.25354514344143386 0.1) 
		(0.07385 0.25295271269969777 0.1) 
		(0.07569999999999999 0.25236935014389833 0.1) 
		(0.07754999999999998 0.2517949387046977 0.1) 
		(0.0794 0.25122936229351556 0.1) 
		(0.08124999999999999 0.25067250579773925 0.1) 
		(0.08309999999999998 0.2501242550759456 0.1) 
		(0.08495 0.249584496953133 0.1) 
		(0.08679999999999999 0.24905311921596435 0.1) 
		(0.08864999999999998 0.24853001060802016 0.1) 
		(0.0905 0.2480150608250628 0.1) 
		(0.09234999999999999 0.24750816051031155 0.1) 
		(0.09419999999999998 0.2470092012497275 0.1) 
		(0.09605 0.2465180755673101 0.1) 
		(0.09789999999999999 0.24603467692040373 0.1) 
		(0.09974999999999998 0.245558899695015 0.1) 
		(0.1016 0.245090639201141 0.1) 
		(0.10345000000000001 0.2446297916681079 0.1) 
		(0.10529999999999998 0.24417625423992043 0.1) 
		(0.10715 0.24372992497062174 0.1) 
		(0.10900000000000001 0.24329070281966442 0.1) 
		(0.11084999999999998 0.24285848764729148 0.1) 
		(0.1127 0.24243318020992877 0.1) 
		(0.11455000000000001 0.2420146821555873 0.1) 
		(0.11639999999999998 0.2416028960192768 0.1) 
		(0.11825 0.24119772521842966 0.1) 
		(0.12010000000000001 0.24079907404833564 0.1) 
		(0.12194999999999998 0.24040684767758708 0.1) 
		(0.1238 0.24002095214353503 0.1) 
		(0.12565 0.2396412943477557 0.1) 
		(0.12749999999999997 0.2392677820515279 0.1) 
		(0.12935 0.23890032387132104 0.1) 
		(0.1312 0.23853882927429365 0.1) 
		(0.13304999999999997 0.23818320857380262 0.1) 
		(0.1349 0.23783337292492324 0.1) 
		(0.13675 0.2374892343199798 0.1) 
		(0.13859999999999997 0.23715070558408677 0.1) 
		(0.14045 0.23681770037070077 0.1) 
		(0.1423 0.2364901331571831 0.1) 
		(0.14414999999999997 0.23616791924037306 0.1) 
		(0.146 0.23585097473217173 0.1) 
		(0.14785 0.2355392165551367 0.1) 
		(0.14969999999999997 0.23523256243808705 0.1) 
		(0.15155 0.23493093091171946 0.1) 
		(0.1534 0.23463424130423455 0.1) 
		(0.15524999999999997 0.23434241373697426 0.1) 
		(0.1571 0.23405536912006944 0.1) 
		(0.15895 0.23377302914809872 0.1) 
		(0.16079999999999997 0.23349531629575737 0.1) 
		(0.16265 0.23322215381353728 0.1) 
		(0.1645 0.23295346572341746 0.1) 
		(0.16634999999999997 0.23268917681456514 0.1) 
		(0.1682 0.23242921263904753 0.1) 
		(0.17005 0.2321734995075545 0.1) 
		(0.17189999999999997 0.2319219644851315 0.1) 
		(0.17375 0.23167453538692334 0.1) 
		(0.1756 0.2314311407739289 0.1) 
		(0.17744999999999997 0.23119170994876592 0.1) 
		(0.1793 0.23095617295144696 0.1) 
		(0.18115 0.2307244605551658 0.1) 
		(0.18299999999999997 0.2304965042620945 0.1) 
		(0.18485 0.23027223629919114 0.1) 
...
);
boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 9 6)
        );
    }
    firstBottomFace
    {
        type slip;
        faces
        (
            (0 1 4 3)
        );
    }
    firstTopFace
    {
        type slip;
        faces
        (
            (6 7 10 9)
        );
    }
    secondTopFace
    {
        type slip;
        faces
        (
            (7 8 11 10)
        );
    }
    wall
    {
        type wall;
        faces
        (
            (1 2 5 4)
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            (2 5 11 8)
        );
    }
    
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 7 6)
            (1 2 8 7)
            (3 4 10 9)
            (4 5 11 10)  
        );
    }
);


// ************************************************************************* //
